diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРеализаций</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыставленныеКОплатеРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбоненскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_По</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
Функция СозданныеАкты(Параметры) Экспорт 
	 
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	РеализацияТоваровУслуг.Договор КАК Договор,
               |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
               |	РеализацияТоваровУслуг.Организация КАК Организация
               |ПОМЕСТИТЬ ВТ_СозданныеДокументы
               |ИЗ
               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
               |		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
               |			И РеализацияТоваровУслуг.Контрагент = ДоговорыКонтрагентов.Владелец
               |ГДЕ
               |	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ
               |	ДоговорыКонтрагентов.Организация КАК Организация,
               |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
               |	ДоговорыКонтрагентов.Ссылка КАК Договор
               |ИЗ
               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СозданныеДокументы КАК ВТ_СозданныеДокументы
               |		ПО ДоговорыКонтрагентов.Ссылка = ВТ_СозданныеДокументы.Договор
               |ГДЕ
               |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
               |	И ДоговорыКонтрагентов.ВКМ_ПериодС <= &ДатаОкончания
               |	И ДоговорыКонтрагентов.ВКМ_По >= &ДатаОкончания
               |	И НЕ ДоговорыКонтрагентов.Ссылка В
               |				(ВЫБРАТЬ
               |					ВТ_СозданныеДокументы.Договор КАК Договор
               |				ИЗ
               |					ВТ_СозданныеДокументы КАК ВТ_СозданныеДокументы)";

Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Параметры.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаОкончания",НачалоДня(Параметры.Период.ДатаОкончания));
Результат = Новый Массив;

Выборка = Запрос.Выполнить().Выбрать();
	
Пока Выборка.Следующий() Цикл

НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
НовыйДокумент.Дата = КонецДня(Параметры.Период.ДатаОкончания);
НовыйДокумент.Договор = Выборка.Договор;
НовыйДокумент.Организация = Выборка.Организация;
НовыйДокумент.Контрагент = Выборка.Контрагент;
НовыйДокумент.Записать();

НовыйДокумент.ВыполнитьАвтозаполнение();	
НовыйДокумент.Услуги.Загрузить(НовыйДокумент.ВыполнитьАвтозаполнение());
НовыйДокумент.ПроверитьЗаполнение();
НовыйДокумент.Записать();

Запись = Новый Структура;
Запись.Вставить("Договор", НовыйДокумент.Договор);
Запись.Вставить("Ссылка", НовыйДокумент.Ссылка);
Результат.Добавить(Запись);

Если НовыйДокумент.ПроверитьЗаполнение() = Истина Тогда
НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
КонецЕсли;

КонецЦикла; 

Возврат Результат;

КонецФункции
